In [1]:
import pandas as pd

C:\Users\Werteryzmy\AppData\Local\Temp\ipykernel_22328\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
titanic = pd.read_csv("titanic.csv")

In [4]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [5]:
print(titanic)

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [6]:
pd.options.display.max_rows

60

In [7]:
pd.options.display.min_rows

10

In [8]:
pd.options.display.min_rows = 20

In [9]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
5           0       3    male   NaN      0      0   8.4583        Q  NaN
6           0       1    male  54.0      0      0  51.8625        S    E
7           0       3    male   2.0      3      1  21.0750        S  NaN
8           1       3  female  27.0      0      2  11.1333        S  NaN
9           1       2  female  14.0      1      0  30.0708        C  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
881         0       3    male  33.0      0      0   7.8958        S  NaN
882         0       3  female  22.0      0      0  10.5167        S  NaN
883         0       2    male  28.0      0      0  10.5000        S  NaN
884         0       3    male  25.0      0      0   7.0500        S  NaN
885         0       3  female  39.0      0      5  29.1250        Q  NaN
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [10]:
titanic.tail(4)

     survived  pclass     sex   age  sibsp  parch   fare embarked deck
887         1       1  female  19.0      0      0  30.00        S    B
888         0       3  female   NaN      1      2  23.45        S  NaN
889         1       1    male  26.0      0      0  30.00        C    C
890         0       3    male  32.0      0      0   7.75        Q  NaN

In [11]:
titanic.head(3)

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN

## First Data inspection

In [12]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
5           0       3    male   NaN      0      0   8.4583        Q  NaN
6           0       1    male  54.0      0      0  51.8625        S    E
7           0       3    male   2.0      3      1  21.0750        S  NaN
8           1       3  female  27.0      0      2  11.1333        S  NaN
9           1       2  female  14.0      1      0  30.0708        C  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
881         0       3    male  33.0      0      0   7.8958        S  NaN
882         0       3  female  22.0      0      0  10.5167        S  NaN
883         0       2    male  28.0      0      0  10.5000        S  NaN
884         0       3    male  25.0      0      0   7.0500        S  NaN
885         0       3  female  39.0      0      5  29.1250        Q  NaN
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [13]:
pd.options.display.min_rows

20

In [14]:
pd.options.display.min_rows = 10

In [15]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [19]:
titanic.groupby(["age"]).count()

       survived  pclass  sex  sibsp  parch  fare  embarked  deck
age
0.42          1       1    1      1      1     1         1     0
0.67          1       1    1      1      1     1         1     0
0.75          2       2    2      2      2     2         2     0
0.83          2       2    2      2      2     2         2     0
0.92          1       1    1      1      1     1         1     1
...         ...     ...  ...    ...    ...   ...       ...   ...
70.00         2       2    2      2      2     2         2     1
70.50         1       1    1      1      1     1         1     0
71.00         2       2    2      2      2     2         2     1
74.00         1       1    1      1      1     1         1     0
80.00         1       1    1      1      1     1         1     1

[88 rows x 8 columns]

In [17]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   sex       891 non-null    object
 3   age       714 non-null    float64
 4   sibsp     891 non-null    int64
 5   parch     891 non-null    int64
 6   fare      891 non-null    float64
 7   embarked  889 non-null    object
 8   deck      203 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

In [20]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [23]:
titanic.describe(include="O")

         sex embarked deck
count    891      889  203
unique     2        3    7
top     male        S    C
freq     577      644   59

## Python Build-in Functions & DataFrame Attributes and Methods

In [24]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

### DataFrames and Python Built-in Functions

In [25]:
type(titanic)

pandas.core.frame.DataFrame

In [26]:
int(titanic)

TypeError: int() argument must be a string, a bytes-like object or a real number, not 'DataFrame'

In [27]:
min(titanic)

'age'

In [28]:
len(titanic)

891

In [29]:
round(titanic, 0)

     survived  pclass     sex   age  sibsp  parch  fare embarked deck
0           0       3    male  22.0      1      0   7.0        S  NaN
1           1       1  female  38.0      1      0  71.0        C    C
2           1       3  female  26.0      0      0   8.0        S  NaN
3           1       1  female  35.0      1      0  53.0        S    C
4           0       3    male  35.0      0      0   8.0        S  NaN
..        ...     ...     ...   ...    ...    ...   ...      ...  ...
886         0       2    male  27.0      0      0  13.0        S  NaN
887         1       1  female  19.0      0      0  30.0        S    B
888         0       3  female   NaN      1      2  23.0        S  NaN
889         1       1    male  26.0      0      0  30.0        C    C
890         0       3    male  32.0      0      0   8.0        Q  NaN

[891 rows x 9 columns]

### DataFrame Attibutes

In [30]:
titanic.shape

(891, 9)

In [31]:
titanic.size

8019

In [32]:
titanic.index

RangeIndex(start=0, stop=891, step=1)

In [33]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'deck'],
      dtype='object')

### DataFrame Methods

In [34]:
titanic.head(n=2)

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C

In [35]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   sex       891 non-null    object
 3   age       714 non-null    float64
 4   sibsp     891 non-null    int64
 5   parch     891 non-null    int64
 6   fare      891 non-null    float64
 7   embarked  889 non-null    object
 8   deck      203 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

In [37]:
titanic.min(numeric_only=True)

survived    0.00
pclass      1.00
age         0.42
sibsp       0.00
parch       0.00
fare        0.00
dtype: float64

### Method Chaining

In [42]:
titanic.mean(numeric_only=True).sort_values().head(n=2).to_frame().reset_index()

      index         0
0     parch  0.381594
1  survived  0.383838

## Make it easy: TAB Completion and Tooltip

In [1]:
import pandas as pd

C:\Users\Werteryzmy\AppData\Local\Temp\ipykernel_28716\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
titanic = pd.read_csv("titanic.csv")

In [3]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [6]:
titanic.sort_values("age",ascending=False)

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
630         1       1    male  80.0      0      0  30.0000        S    A
851         0       3    male  74.0      0      0   7.7750        S  NaN
493         0       1    male  71.0      0      0  49.5042        C  NaN
96          0       1    male  71.0      0      0  34.6542        C    A
116         0       3    male  70.5      0      0   7.7500        Q  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
859         0       3    male   NaN      0      0   7.2292        C  NaN
863         0       3  female   NaN      8      2  69.5500        S  NaN
868         0       3    male   NaN      0      0   9.5000        S  NaN
878         0       3    male   NaN      0      0   7.8958        S  NaN
888         0       3  female   NaN      1      2  23.4500        S  NaN

[891 rows x 9 columns]

In [7]:
titanic.sort_values("fare",ascending=False)

     survived  pclass     sex   age  sibsp  parch      fare embarked deck
258         1       1  female  35.0      0      0  512.3292        C  NaN
737         1       1    male  35.0      0      0  512.3292        C    B
679         1       1    male  36.0      0      1  512.3292        C    B
88          1       1  female  23.0      3      2  263.0000        S    C
27          0       1    male  19.0      3      2  263.0000        S    C
..        ...     ...     ...   ...    ...    ...       ...      ...  ...
633         0       1    male   NaN      0      0    0.0000        S  NaN
413         0       2    male   NaN      0      0    0.0000        S  NaN
822         0       1    male  38.0      0      0    0.0000        S  NaN
732         0       2    male   NaN      0      0    0.0000        S  NaN
674         0       2    male   NaN      0      0    0.0000        S  NaN

[891 rows x 9 columns]

In [8]:
titanic.sort_values(by="age",ascending=False)

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
630         1       1    male  80.0      0      0  30.0000        S    A
851         0       3    male  74.0      0      0   7.7750        S  NaN
493         0       1    male  71.0      0      0  49.5042        C  NaN
96          0       1    male  71.0      0      0  34.6542        C    A
116         0       3    male  70.5      0      0   7.7500        Q  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
859         0       3    male   NaN      0      0   7.2292        C  NaN
863         0       3  female   NaN      8      2  69.5500        S  NaN
868         0       3    male   NaN      0      0   9.5000        S  NaN
878         0       3    male   NaN      0      0   7.8958        S  NaN
888         0       3  female   NaN      1      2  23.4500        S  NaN

[891 rows x 9 columns]

In [9]:
titanic.sort_values(by=["age","fare"],ascending=False)

     survived  pclass   sex   age  sibsp  parch     fare embarked deck
630         1       1  male  80.0      0      0  30.0000        S    A
851         0       3  male  74.0      0      0   7.7750        S  NaN
493         0       1  male  71.0      0      0  49.5042        C  NaN
96          0       1  male  71.0      0      0  34.6542        C    A
116         0       3  male  70.5      0      0   7.7500        Q  NaN
..        ...     ...   ...   ...    ...    ...      ...      ...  ...
481         0       2  male   NaN      0      0   0.0000        S  NaN
633         0       1  male   NaN      0      0   0.0000        S  NaN
674         0       2  male   NaN      0      0   0.0000        S  NaN
732         0       2  male   NaN      0      0   0.0000        S  NaN
815         0       1  male   NaN      0      0   0.0000        S    B

[891 rows x 9 columns]

In [10]:
titanic.sort_values(by=["fare","age"],ascending=False)

     survived  pclass     sex   age  sibsp  parch      fare embarked deck
679         1       1    male  36.0      0      1  512.3292        C    B
258         1       1  female  35.0      0      0  512.3292        C  NaN
737         1       1    male  35.0      0      0  512.3292        C    B
438         0       1    male  64.0      1      4  263.0000        S    C
341         1       1  female  24.0      3      2  263.0000        S    C
..        ...     ...     ...   ...    ...    ...       ...      ...  ...
481         0       2    male   NaN      0      0    0.0000        S  NaN
633         0       1    male   NaN      0      0    0.0000        S  NaN
674         0       2    male   NaN      0      0    0.0000        S  NaN
732         0       2    male   NaN      0      0    0.0000        S  NaN
815         0       1    male   NaN      0      0    0.0000        S    B

[891 rows x 9 columns]

In [11]:
titanic.info

<bound method DataFrame.info of      survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]>

In [13]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [14]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   sex       891 non-null    object
 3   age       714 non-null    float64
 4   sibsp     891 non-null    int64
 5   parch     891 non-null    int64
 6   fare      891 non-null    float64
 7   embarked  889 non-null    object
 8   deck      203 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

## Selecting Columns

In [15]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [17]:
titanic["age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [18]:
titanic["age"].to_frame()

      age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

In [19]:
type(titanic["age"])

pandas.core.series.Series

In [20]:
type(titanic["age"].to_frame())

pandas.core.frame.DataFrame

In [21]:
titanic[["age","sex"]]

      age     sex
0    22.0    male
1    38.0  female
2    26.0  female
3    35.0  female
4    35.0    male
..    ...     ...
886  27.0    male
887  19.0  female
888   NaN  female
889  26.0    male
890  32.0    male

[891 rows x 2 columns]

In [22]:
type(titanic[["age","sex"]])

pandas.core.frame.DataFrame

In [23]:
titanic[["sex","age"]]

        sex   age
0      male  22.0
1    female  38.0
2    female  26.0
3    female  35.0
4      male  35.0
..      ...   ...
886    male  27.0
887  female  19.0
888  female   NaN
889    male  26.0
890    male  32.0

[891 rows x 2 columns]

In [24]:
titanic[["age","sex","fare"]]

      age     sex     fare
0    22.0    male   7.2500
1    38.0  female  71.2833
2    26.0  female   7.9250
3    35.0  female  53.1000
4    35.0    male   8.0500
..    ...     ...      ...
886  27.0    male  13.0000
887  19.0  female  30.0000
888   NaN  female  23.4500
889  26.0    male  30.0000
890  32.0    male   7.7500

[891 rows x 3 columns]

In [25]:
titanic[["age"]]

      age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

In [26]:
type(titanic[["age"]])

pandas.core.frame.DataFrame

## Selecting one Column with "dot notation

In [28]:
titanic.age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [30]:
titanic.age.equals(titanic["age"])

True

In [31]:
titanic.embarked

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: embarked, Length: 891, dtype: object

In [36]:
fare = titanic["fare"]
fare

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: fare, Length: 891, dtype: float64

In [40]:
!python --version

Python 3.12.1

In [41]:
pd.__version__

'2.2.0'

In [45]:
class MercedezBenz:
    doors = 2
    wheels = 4

In [46]:
MercedezBenz.doors

2

In [47]:
MercedezBenz.wheels

4

In [50]:
MercedezBenz.model = "S"

In [51]:
MercedezBenz.__dict__

mappingproxy({'__module__': '__main__',
              'doors': 2,
              'wheels': 4,
              '__dict__': <attribute '__dict__' of 'MercedezBenz' objects>,
              '__weakref__': <attribute '__weakref__' of 'MercedezBenz' objects>,
              '__doc__': None,
              'model': 'S'})

In [52]:
w223 = MercedezBenz()

In [53]:
w223

In [54]:
w223.doors

2

In [55]:
w223.wheels

4

In [57]:
def drive():
    return "A car is being driven."

In [59]:
drive()

'A car is being driven.'

In [60]:
class MercedezBenz:
    doors = 4
    sheels = 4
    model = "S"

    def drive(self):
        return self

In [61]:
w220 = MercedezBenz()

In [62]:
w220.drive()

In [63]:
w220 == w220.drive()

True

In [64]:
w220 == MercedezBenz

False

In [65]:
class MercedezBenz:
    doors = 4
    wheels = 4
    model = "S"

    def drive(self):
        return f"A Mercedex is driving and is {self}\n"

In [66]:
w220 = MercedezBenz()

In [67]:
w220.drive()

'A Mercedex is driving and is <__main__.MercedezBenz object at 0x000001FDE9D1B980>\n'

In [68]:
type(MercedezBenz.drive)

function

In [69]:
w220.color = "black"

In [70]:
class MercedezBenz:
    doors = 4
    wheels = 4
    model = "S"

    def __init__(self, color) -> None: #after instance creation, but before it is returned.
        self.color = color

    def drive(self):
        return f"A Mercedex is driving and is {self}"

In [71]:
MercedezBenz()

TypeError: MercedezBenz.__init__() missing 1 required positional argument: 'color'

In [72]:
w223 = MercedezBenz("black")
w222 = MercedezBenz("Red")

In [73]:
w223.color, w222.color

('black', 'Red')

In [74]:
w222.color = "green"
w222.color

'green'

In [75]:
w140 = MercedezBenz("silver")
w140.color

'silver'

In [78]:
w223.color = "midnight blue"
getattr(w223, "color")

'midnight blue'

In [79]:
setattr(w223, "color", "reddish")
w223.color

'reddish'

In [80]:
objs = [w223, w222]
attribs = ["color", "doors"]
values = ["navy blue", 3]

In [81]:
for obj in objs:
    for attr in attribs:
        print(f"{getattr(obj, attr)}")

reddish
4
green
4

In [82]:
objs

[<__main__.MercedezBenz at 0x1fde9d1c1a0>,
 <__main__.MercedezBenz at 0x1fde9d1e540>]

In [84]:
range(len(attribs))

range(0, 2)

In [87]:
for obj in objs:
    for i in range(len(attribs)):
        setattr(obj, attribs[i], values[i])

In [88]:
for obj in objs:
    for i in range(len(attribs)):
        print(f"{getattr(obj, attribs[i])}, {getattr(obj, attribs[i])}")

navy blue, navy blue
3, 3
navy blue, navy blue
3, 3

In [90]:
values = ["Weeee", 9]

In [91]:
for obj in objs:
    for attrib, val in zip(attribs, values):
        setattr(obj, attrib, val)

In [92]:
w222.color, w223.color

('Weeee', 'Weeee')

In [93]:
MercedezBenz.doors

4

In [94]:
list(zip(attribs, values))

[('color', 'Weeee'), ('doors', 9)]

In [95]:
for obj in objs:
    for attr in attribs:
        print(f"{getattr(obj, attr)}")

Weeee
9
Weeee
9

In [96]:
try:
    print(w223.wingspan)
except AttributeError as e:
    print(e)

'MercedezBenz' object has no attribute 'wingspan'

In [97]:
class MercedezBenz:
    doors = 4
    wheels = 4
    model = "S"

    def __init__(self, color="midnight blue") -> None: #after instance creation, but before it is returned.
        self.color = color

    def drive(self):
        return f"A Mercedes is driving and is {self}\n"
    
    def auto_drive():
        return "Auto-driving for now..."

In [98]:
m123 = MercedezBenz("Pink")

In [99]:
m123.auto_drive()

TypeError: MercedezBenz.auto_drive() takes 0 positional arguments but 1 was given

In [100]:
class MercedezBenz:
    doors = 4
    wheels = 4
    model = "S"

    def __init__(self, color="midnight blue") -> None: #after instance creation, but before it is returned.
        self.color = color

    def drive(self):
        return f"A Mercedes is driving and is {self}\n"
    
    def auto_drive(self):
        return "Auto-driving for now..."

In [101]:
w124 = MercedezBenz("White")
w124.auto_drive()

'Auto-driving for now...'

In [106]:
from random import randint

class Student:
    education_platform = "udemy"
    name = ""
    age = 0

    def __init__(self, name, age=99) -> None:
        self.name = name
        self.age = age

    def greet(self):
        i = randint(0, 2)
        greetings = ["Ni, I`m ", "Hey there, my name is ", "Hi, oh, my name is "]
        return f"{greetings[i]}{self.name}"

In [107]:
asha = Student("Asha")
michael = Student("Michael")
arjun = Student("Arjun")
roland = Student("Roland")

students = [asha, michael, arjun, roland]

In [108]:
names = ["asha", "michael", "arjun", "roland", "alice", "brian", "clayton", "deirdre", "eleon", "faye"]

for student in students:
    print(f"{student.greet()}, My age is {student.age}")

Ni, I`m Asha, My age is 99
Hi, oh, my name is Michael, My age is 99
Hi, oh, my name is Arjun, My age is 99
Ni, I`m Roland, My age is 99

In [111]:
for i in range(10):
    print(f"{randint(43,74)}")

65
59
55
58
46
52
71
54
45
66

In [112]:
def class_create(student_names):
    return [Student(name) for name in student_names]

In [113]:
for student in class_create(names):
    print(student.greet())

Hi, oh, my name is asha
Hi, oh, my name is michael
Hi, oh, my name is arjun
Hi, oh, my name is roland
Ni, I`m alice
Hey there, my name is brian
Ni, I`m clayton
Hi, oh, my name is deirdre
Hey there, my name is eleon
Hey there, my name is faye

In [114]:
class MercedezBenz:
    doors = 4
    wheels = 4
    model = "E"

    def __init__(self, color="midnight blue") -> None: #After instance creation, but before it is returned.
        self.color = color

    def drive(self):
        return f"A Mercedes i driving and is: {self}"
    
    @staticmethod
    def auto_drive():
        return "Auto-driving for now...."

In [115]:
w124 = MercedezBenz()
w124.auto_drive()

'Auto-driving for now....'

In [116]:
MercedezBenz.auto_drive()

'Auto-driving for now....'

In [117]:
class MercedezBenz:
    doors = 4
    wheels = 4
    model = "E"

    def __init__(self, color="midnight blue") -> None: #After instance creation, but before it is returned.
        self.color = color

    def drive(self):
        return f"A Mercedes i driving and is: {self}"
    
    @staticmethod
    def auto_drive():
        return "Auto-driving for now...."
    
    @classmethod
    def create_lease(cls):
        print(f"A lease for {cls} will be created.")

In [118]:
MercedezBenz.create_lease()

A lease for <class '__main__.MercedezBenz'> will be created.

In [119]:
MercedezBenz.auto_drive()

'Auto-driving for now....'

In [120]:
w111 = MercedezBenz()
w111.create_lease()

A lease for <class '__main__.MercedezBenz'> will be created.

In [122]:
class MercedezBenz:
    doors = 4
    wheels = 4
    model = "E"

    def __init__(self, color="midnight blue") -> None: #After instance creation, but before it is returned.
        self.color = color

    def drive(self):
        return f"A Mercedes i driving and is: {self}"
    
    def auto_drive():
        return "Auto-driving for now...."
    
    def create_lease(cls):
        print(f"A lease for {cls} will be created.")

    create_lease = classmethod(create_lease)
    auto_drive = staticmethod(auto_drive)

In [123]:
MercedezBenz.auto_drive()

'Auto-driving for now....'

In [124]:
MercedezBenz.create_lease()

A lease for <class '__main__.MercedezBenz'> will be created.

In [125]:
class MercedezBenz:
    doors = 4
    wheels = 4
    model = "E"

    def __init__(self, color="midnight blue") -> None: #After instance creation, but before it is returned.
        self.color = color

    def drive(self):
        return f"A Mercedes i driving and is: {self}"
    
    @staticmethod
    def auto_drive():
        return "Auto-driving for now...."
    
    @classmethod
    def create_lease(cls):
        print(f"A lease for {cls} will be created.")

In [126]:
w124 = MercedezBenz()
w124.auto_drive()

'Auto-driving for now....'

In [127]:
MercedezBenz.auto_drive()

'Auto-driving for now....'

In [128]:
class MercedezBenz:
    doors = 4
    wheels = 4
    model = "E"

    def __init__(self, color="midnight blue") -> None: #After instance creation, but before it is returned.
        self.color = color

    def drive(self):
        return f"A Mercedes i driving and is: {self}"
    
    @staticmethod
    def auto_drive():
        return "Auto-driving for now...."
    
    @classmethod
    def create_lease(cls):
        print(f"A lease for {cls} will be created.")

In [129]:
MercedezBenz.__dict__

mappingproxy({'__module__': '__main__',
              'doors': 4,
              'wheels': 4,
              'model': 'E',
              '__init__': <function __main__.MercedezBenz.__init__(self, color='midnight blue') -> None>,
              'drive': <function __main__.MercedezBenz.drive(self)>,
              'auto_drive': <staticmethod(<function MercedezBenz.auto_drive at 0x000001FDE9C1DA80>)>,
              'create_lease': <classmethod(<function MercedezBenz.create_lease at 0x000001FDE9C1CCC0>)>,
              '__dict__': <attribute '__dict__' of 'MercedezBenz' objects>,
              '__weakref__': <attribute '__weakref__' of 'MercedezBenz' objects>,
              '__doc__': None})

In [130]:
type(MercedezBenz.__dict__)

mappingproxy

In [131]:
w124.__dict__

{'color': 'midnight blue'}

In [132]:
w123 = MercedezBenz()
w124 = MercedezBenz()

In [133]:
w123.doors = 5
w124.doors = 6

In [134]:
w123.doors, w124.doors

(5, 6)

In [135]:
w223 = MercedezBenz()
w223.doors

4

In [136]:
class Tire:
    def __init__(self, kind, distance_covered) -> None:
        self.kind = kind
        self.distance_covered = distance_covered

In [137]:
class MercedezBenz:
    doors = 4
    wheels = 4
    model = "E"
    tires = [Tire("operational", 10) for i in range(4)]

    def __init__(self, color="midnight blue") -> None: #After instance creation, but before it is returned.
        self.color = color

    def drive(self):
        return f"A Mercedes i driving and is: {self}"
    
    @staticmethod
    def auto_drive():
        return "Auto-driving for now...."
    
    @classmethod
    def create_lease(cls):
        print(f"A lease for {cls} will be created.")

In [138]:
w223 = MercedezBenz()
w223.tires

[<__main__.Tire at 0x1fde95fc9b0>,
 <__main__.Tire at 0x1fde9802c60>,
 <__main__.Tire at 0x1fde9d1c7d0>,
 <__main__.Tire at 0x1fde9d1e2a0>]

In [139]:
w222 = MercedezBenz()
w222.tires

[<__main__.Tire at 0x1fde95fc9b0>,
 <__main__.Tire at 0x1fde9802c60>,
 <__main__.Tire at 0x1fde9d1c7d0>,
 <__main__.Tire at 0x1fde9d1e2a0>]

In [140]:
w223.tires.append(Tire(kind="spare", distance_covered=1000))

In [141]:
w222.tires

[<__main__.Tire at 0x1fde95fc9b0>,
 <__main__.Tire at 0x1fde9802c60>,
 <__main__.Tire at 0x1fde9d1c7d0>,
 <__main__.Tire at 0x1fde9d1e2a0>,
 <__main__.Tire at 0x1fde9b07aa0>]

In [142]:
w223.tires

[<__main__.Tire at 0x1fde95fc9b0>,
 <__main__.Tire at 0x1fde9802c60>,
 <__main__.Tire at 0x1fde9d1c7d0>,
 <__main__.Tire at 0x1fde9d1e2a0>,
 <__main__.Tire at 0x1fde9b07aa0>]

In [143]:
w201 = MercedezBenz("Lavender")

In [144]:
w201.doors += 1
w201.doors

5

In [145]:
w201.doors = "Andy"
w201.doors

'Andy'

In [146]:
w201.doors = 1.2
w201.doors

1.2

In [148]:
help(getattr)

Help on built-in function getattr in module builtins:

getattr(...)
    Get a named attribute from an object.

    getattr(x, 'y') is equivalent to x.y
    When a default argument is given, it is returned when the attribute doesn't
    exist; without it, an exception is raised in that case.

In [150]:
help(Tire)

Help on class Tire in module __main__:

class Tire(builtins.object)
 |  Tire(kind, distance_covered) -> None
 |
 |  Methods defined here:
 |
 |  __init__(self, kind, distance_covered) -> None
 |      Initialize self.  See help(type(self)) for accurate signature.
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors defined here:
 |
 |  __dict__
 |      dictionary for instance variables
 |
 |  __weakref__
 |      list of weak references to the object

In [151]:
class Tire:
    '''
    Defines an automobile tire object.

    :param kind: the kind of tire, e.g. operational, spare or winter
    :param distance_covered: the distance in km the tire has covered
    '''
    def __init__(self, kind, distance_covered) -> None:
        self.kind = kind
        self.distance_covered = distance_covered

In [152]:
help(Tire)

Help on class Tire in module __main__:

class Tire(builtins.object)
 |  Tire(kind, distance_covered) -> None
 |
 |  Defines an automobile tire object.
 |
 |  :param kind: the kind of tire, e.g. operational, spare or winter
 |  :param distance_covered: the distance in km the tire has covered
 |
 |  Methods defined here:
 |
 |  __init__(self, kind, distance_covered) -> None
 |      Initialize self.  See help(type(self)) for accurate signature.
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors defined here:
 |
 |  __dict__
 |      dictionary for instance variables
 |
 |  __weakref__
 |      list of weak references to the object

In [153]:
Tire.__dict__

mappingproxy({'__module__': '__main__',
              '__doc__': '\n    Defines an automobile tire object.\n\n    :param kind: the kind of tire, e.g. operational, spare or winter\n    :param distance_covered: the distance in km the tire has covered\n    ',
              '__init__': <function __main__.Tire.__init__(self, kind, distance_covered) -> None>,
              '__dict__': <attribute '__dict__' of 'Tire' objects>,
              '__weakref__': <attribute '__weakref__' of 'Tire' objects>})

In [154]:
import string
string.ascii_letters, string.digits, string.punctuation

('abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ',
 '0123456789',
 '!"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}~')

In [155]:
letters = [s for s in string.ascii_letters]
letters

['a',
 'b',
 'c',
 'd',
 'e',
 'f',
 'g',
 'h',
 'i',
 'j',
 'k',
 'l',
 'm',
 'n',
 'o',
 'p',
 'q',
 'r',
 's',
 't',
 'u',
 'v',
 'w',
 'x',
 'y',
 'z',
 'A',
 'B',
 'C',
 'D',
 'E',
 'F',
 'G',
 'H',
 'I',
 'J',
 'K',
 'L',
 'M',
 'N',
 'O',
 'P',
 'Q',
 'R',
 'S',
 'T',
 'U',
 'V',
 'W',
 'X',
 'Y',
 'Z']

In [158]:
letters = [l for l in string.ascii_lowercase]
numbers = [d for d in string.digits]
punctuation = [p for p in string.punctuation]

pool_of_characters = {'letters': letters,
                      "numbers": numbers,
                      "punctuation": punctuation}

pool_of_characters.get("letters")

['a',
 'b',
 'c',
 'd',
 'e',
 'f',
 'g',
 'h',
 'i',
 'j',
 'k',
 'l',
 'm',
 'n',
 'o',
 'p',
 'q',
 'r',
 's',
 't',
 'u',
 'v',
 'w',
 'x',
 'y',
 'z']

In [159]:
class Book:
    def __init__(self, title, author, book_type, pages):
        self.title = title
        self.author = author
        self.book_type = book_type
        self.pages = pages

    def __repr__(self) -> str:
        return f"Book('{self.title}', '{self.author}', '{self.book_type}', {self.pages})"
    
    def __format__(self, __format_spec: str) -> str:
        if __format_spec == 'short':
            return f"{self.title} - {self.author}"
        elif __format_spec == 'stealth':
            return f"A book containing exacly: {self.pages}. Guess?"
        
        return repr(self)

b = Book('Antyfragile', 'Nassim Taleb', 'Non-fiction', 519)

In [160]:
f"{b:short}"

'Antyfragile - Nassim Taleb'

In [161]:
f"{b:stealth}"

'A book containing exacly: 519. Guess?'

In [162]:
class Book:
    def __init__(self, title, author, book_type, pages):
        self.title = title
        self.author = author
        self.book_type = book_type
        self.pages = pages

    def __repr__(self) -> str:
        return f"Book('{self.title}', '{self.author}', '{self.book_type}', {self.pages})"
    
    def __eq__(self, __o: object) -> bool:
        if not isinstance(__o, Book):
            return False
        
        return self.title == __o.title and self.author == __o.author

In [163]:
b_v1 = Book('Antyfragile', 'Nassim Taleb', 'Non-fiction', 519)
b_v2 = Book('Antyfragile', 'Nassim Taleb', 'Non-fiction', 519)
b_v3 = Book('Antyfragile', 'Nassim Taleb The II', 'Non-fiction', 519)

In [164]:
b_v2 == b_v1

True

In [165]:
b_v1 == b_v3

False

In [169]:
def bingo():
    return randint(1, 47)

In [170]:
def even_or_odd(func):
    def inner():
        num = func()
        print(f"The selected number is {'even' if num % 2 == 0 else 'odd'}")
        return num
    return inner

In [171]:
bingo = even_or_odd(bingo)

In [172]:
for i in range(4):    
    print(bingo())

The selected number is odd
3
The selected number is odd
39
The selected number is odd
17
The selected number is odd
23